In [16]:
import pandas as pd
from matplotlib import pyplot as plt

In [17]:
prediction = pd.read_csv('prediction.csv')
prediction.head(5)

   prediction
0         294
1          66
2         113
3          90
4         846

In [18]:
submission = pd.read_csv('final_sub.csv')
submission.head(5)

,CID_X_LOC_NUM_X_VENDOR,target,customer_id,location_number,vendor_id,c_l,c_latitude,c_longitude
0,Z59FTQD X 0 X 243,0,Z59FTQD,0,243,Z59FTQD_0,126.032278,-9.106019
1,0JP29SK X 0 X 243,0,0JP29SK,0,243,0JP29SK_0,0.278709,-78.623847
2,0JP29SK X 1 X 243,0,0JP29SK,1,243,0JP29SK_1,0.124485,-78.605621
3,0JP29SK X 2 X 243,0,0JP29SK,2,243,0JP29SK_2,-0.113891,-78.577449
4,0JP29SK X 3 X 243,0,0JP29SK,3,243,0JP29SK_3,-0.848796,0.136726

In [19]:
submission.isna().sum()

CID_X_LOC_NUM_X_VENDOR         0
target                         0
customer_id                46500
location_number             5200
vendor_id                    300
c_l                            0
c_latitude                299500
c_longitude               299500
dtype: int64

In [20]:
prediction.shape

(1372500, 1)

In [21]:
submission.shape

(1672000, 8)

In [27]:
submission_f = submission.dropna()
submission_f = submission_f.reset_index(drop=True)
submission_f.shape

(1372500, 8)

In [28]:
submission_f1 = submission_f.drop(['target', 'customer_id', 'location_number', 'c_l', 'c_latitude', 'c_longitude'], axis=1)
submission_f1.head(5)

  CID_X_LOC_NUM_X_VENDOR vendor_id
0      Z59FTQD X 0 X 243       243
1      0JP29SK X 0 X 243       243
2      0JP29SK X 1 X 243       243
3      0JP29SK X 2 X 243       243
4      0JP29SK X 3 X 243       243

In [29]:
submission_f1.isna().sum()

CID_X_LOC_NUM_X_VENDOR    0
vendor_id                 0
dtype: int64

In [30]:
final_submission = pd.merge(submission_f1, prediction, left_index=True, right_index=True)
final_submission.shape

(1372500, 3)

In [31]:
final_submission.isna().sum()

CID_X_LOC_NUM_X_VENDOR    0
vendor_id                 0
prediction                0
dtype: int64

In [32]:
final_submission.head(5)

  CID_X_LOC_NUM_X_VENDOR vendor_id  prediction
0      Z59FTQD X 0 X 243       243         294
1      0JP29SK X 0 X 243       243          66
2      0JP29SK X 1 X 243       243         113
3      0JP29SK X 2 X 243       243          90
4      0JP29SK X 3 X 243       243         846

In [33]:
len = len(final_submission)
len

1372500

In [42]:
import numpy as np
comparison_column = np.where(final_submission["vendor_id"] == final_submission["prediction"], 1, 0)

In [46]:
comparison_column

array([0, 0, 0, ..., 0, 0, 0])

In [47]:
com = pd.DataFrame(data = comparison_column, columns = ['target'])
com.head(5)

   target
0       0
1       0
2       0
3       0
4       0

In [48]:
final_submission = pd.merge(final_submission, com, left_index=True, right_index=True)
final_submission.head(5)

  CID_X_LOC_NUM_X_VENDOR vendor_id  prediction  target
0      Z59FTQD X 0 X 243       243         294       0
1      0JP29SK X 0 X 243       243          66       0
2      0JP29SK X 1 X 243       243         113       0
3      0JP29SK X 2 X 243       243          90       0
4      0JP29SK X 3 X 243       243         846       0

In [49]:
final_submission.isna().sum()

CID_X_LOC_NUM_X_VENDOR    0
vendor_id                 0
prediction                0
target                    0
dtype: int64

In [50]:
final_submission.shape

(1372500, 4)

In [51]:
final_submission = final_submission.drop(['vendor_id', 'prediction'], axis=1)
final_submission.head(5)

  CID_X_LOC_NUM_X_VENDOR  target
0      Z59FTQD X 0 X 243       0
1      0JP29SK X 0 X 243       0
2      0JP29SK X 1 X 243       0
3      0JP29SK X 2 X 243       0
4      0JP29SK X 3 X 243       0

In [52]:
final_submission.to_csv('final_submission.csv', index=False)